'use strict'

// Пользователь также может отменить ввод нажатием на кнопку «Отмена» 
// или нажав на клавишу Esc. В этом случае значением result станет null.

// ! Вызов prompt возвращает текст, указанный в поле для ввода, или null, если ввод отменён пользователем.

// let result = prompt('Введите имя', 'Ivan');
// alert(`Добрый день, ${result}!`)

// let isBoss = confirm('Ты здесь босс?');
// alert(isBoss)

// Задача 2.6.1 Создайте страницу, которая спрашивает имя у пользователя и выводит его.
// let userName = prompt('Как Ваше имя?', '');
// alert(`Приветствую, ${userName}!`)